superzscy/esp32-distanceRanging/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Adafruit_VL53L1X.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <BluetoothSerial.h>
#include <algorithm>
#include <esp_spp_api.h>
#include <esp_bt_main.h>
#if __has_include(<esp_bt.h>)
#include <esp_bt.h>
#define HAS_ESP_BT_H 1
#else
#define HAS_ESP_BT_H 0
#endif
#if __has_include(<esp_idf_version.h>)
#include <esp_idf_version.h>
#endif

#if HAS_ESP_BT_H && defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
#define HAS_BT_MODEM_SLEEP_API 1
#else
#define HAS_BT_MODEM_SLEEP_API 0
#endif

// =========================
// arguments
// =========================

bool g_enableRanging = false;
bool g_enableHttpReport = false;
bool g_enableDisplay = false;

#ifndef WIFI_SSID
#define WIFI_SSID ""
#define WIFI_SSID_FROM_ENV 0
#else
#define WIFI_SSID_FROM_ENV 1
#endif

#ifndef WIFI_PASS
#define WIFI_PASS ""
#define WIFI_PASS_FROM_ENV 0
#else
#define WIFI_PASS_FROM_ENV 1
#endif

#ifndef WIFI_CREDENTIALS_STRICT
#define WIFI_CREDENTIALS_STRICT 1
#endif

#if WIFI_SSID_FROM_ENV == 0
#warning "WIFI_SSID not injected from build flags. It is empty by default."
#endif

#if WIFI_PASS_FROM_ENV == 0
#warning "WIFI_PASS not injected from build flags. It is empty by default."
#endif

constexpr bool WIFI_SSID_CONFIGURED = (sizeof(WIFI_SSID) > 1);
constexpr bool WIFI_PASS_CONFIGURED = (sizeof(WIFI_PASS) > 1);

// I2C pins
constexpr int I2C_SDA = 21;
constexpr int I2C_SCL = 22;

// WiFi arguments (injected from build_flags + system env vars)
constexpr uint32_t WIFI_CONNECT_TIMEOUT_MS = 10000;
constexpr const char* BT_DEVICE_NAME = "DR-ESP32";

// HTTP report arguments
constexpr const char* REPORT_SERVER = "http://debian.lan:8088";
constexpr const char* REPORT_API = "/api/distance";

// OLED arguments
constexpr int SCREEN_WIDTH  = 128;
constexpr int SCREEN_HEIGHT = 32;
constexpr int OLED_RESET    = -1;
constexpr uint8_t OLED_ADDR = 0x3C;

// battery arguments
// Adjust BATTERY_DIVIDER_RATIO according to your voltage divider hardware.
constexpr int BATTERY_ADC_PIN = 34;
constexpr float BATTERY_DIVIDER_RATIO = 2.0f;
constexpr int BATTERY_EMPTY_MV = 3300;
constexpr int BATTERY_FULL_MV = 4200;
constexpr uint32_t BATTERY_READ_INTERVAL_MS = 30000;
constexpr int BATTERY_ADC_SAMPLES = 8;

// refresh arguments
constexpr uint16_t SAMPLES_PER_SECOND = 10;
constexpr uint32_t STATS_WINDOW_MS    = 1000;
constexpr uint32_t SAMPLE_INTERVAL_MS = STATS_WINDOW_MS / SAMPLES_PER_SECOND;
constexpr uint8_t MAX_EMPTY_WINDOWS_BEFORE_RECOVER = 3;

// =========================
// globals
// =========================

Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);

class SafeAdafruitVL53L1X : public Adafruit_VL53L1X
{
public:
    SafeAdafruitVL53L1X()
        : Adafruit_VL53L1X()
    {
        // Work around library default-pin conversion issue: force "no GPIO control".
        gpio0 = -1;
    }
};

SafeAdafruitVL53L1X vl53;
BluetoothSerial SerialBT;
bool g_isRangingActive = false;
bool g_isWiFiActive = false;
bool g_isBluetoothInitialized = false;
bool g_isDisplayActive = false;
bool g_isLowPowerActive = false;
volatile bool g_btClientConnected = false;

constexpr uint32_t STANDBY_ENTER_DELAY_MS = 1500;

enum class CalibrationCmd : uint8_t
{
    None = 0,
    C1,
    C2
};

bool g_hasInitialHeight = false;
int g_initialHeightMm = 0;
CalibrationCmd g_pendingCalibrationCmd = CalibrationCmd::None;

int g_batteryVoltageMv = 0;
int g_batteryPercent = -1;
String g_batteryLevel = "unknown";

void logCommandMessage(const String& msg);
void stopRangingIfNeeded();
void stopWiFiIfNeeded();

// =========================
// helper function
// =========================

void showCenteredText(const String& line1, const String& line2 = "")
{
    if (!g_isDisplayActive)
    {
        return;
    }

    display.clearDisplay();
    display.setTextColor(SSD1306_WHITE);

    display.setTextSize(1);

    int16_t x1, y1;
    uint16_t w1, h1;
    display.getTextBounds(line1, 0, 0, &x1, &y1, &w1, &h1);
    int line1X = (SCREEN_WIDTH - static_cast<int>(w1)) / 2;
    int line1Y = line2.length() > 0 ? 6 : 12;

    display.setCursor(line1X, line1Y);
    display.println(line1);

    if (line2.length() > 0)
    {
        int16_t x2, y2;
        uint16_t w2, h2;
        display.getTextBounds(line2, 0, 0, &x2, &y2, &w2, &h2);
        int line2X = (SCREEN_WIDTH - static_cast<int>(w2)) / 2;
        int line2Y = 20;

        display.setCursor(line2X, line2Y);
        display.println(line2);
    }

    display.display();
}

void showDistanceScreen(int distanceMm)
{
    if (!g_isDisplayActive)
    {
        return;
    }

    display.clearDisplay();
    display.setTextColor(SSD1306_WHITE);

    display.setTextSize(1);
    display.setCursor(0, 0);
    display.println("VL53L1X Distance");

    display.drawLine(0, 10, SCREEN_WIDTH - 1, 10, SSD1306_WHITE);

    display.setTextSize(2);
    display.setCursor(0, 14);
    display.print(distanceMm);
    display.print(" mm");

    display.display();
}

void showErrorScreen(const String& msg)
{
    if (!g_isDisplayActive)
    {
        return;
    }

    display.clearDisplay();
    display.setTextColor(SSD1306_WHITE);
    display.setTextSize(1);

    display.setCursor(0, 0);
    display.println("Error:");

    display.setCursor(0, 14);
    display.println(msg);

    display.display();
}

bool initOLED()
{
    if (!display.begin(SSD1306_SWITCHCAPVCC, OLED_ADDR))
    {
        Serial.println("[ERROR] OLED init failed");
        return false;
    }

    display.clearDisplay();
    display.display();
    return true;
}

bool initVL53L1X()
{
    if (!vl53.begin(0x29, &Wire))
    {
        Serial.println("[ERROR] VL53L1X init failed");
        return false;
    }

    // optional options:
    // VL53L1X::Short
    // VL53L1X::Medium
    // VL53L1X::Long
    if (vl53.VL53L1X_SetDistanceMode(2) != VL53L1X_ERROR_NONE)
    {
        Serial.println("[WARN] Failed to set distance mode");
    }

    // the bigger timing budget, the stabler it is, but slower refresh rate
    // optional values: 20, 50, 100, 200, 500
    if (!vl53.setTimingBudget(100))
    {
        Serial.println("[WARN] Failed to set timing budget");
    }

    if (vl53.VL53L1X_SetInterMeasurementInMs(55) != VL53L1X_ERROR_NONE)
    {
        Serial.println("[WARN] Failed to set inter-measurement period");
    }

