superzscy/esp32-distanceRanging/src/main.cpp
    if (!vl53.startRanging())
    {
        Serial.println("[ERROR] VL53L1X start ranging failed");
        return false;
    }
    Serial.println("[INFO] VL53L1X ranging started");
    return true;
}

bool recoverVL53L1X()
{
    vl53.stopRanging();
    delay(5);
    if (!vl53.startRanging())
    {
        Serial.println("[ERROR] VL53L1X restart ranging failed");
        return false;
    }
    Serial.println("[WARN] VL53L1X ranging restarted");
    return true;
}

bool readDistanceMm(int& outDistance, bool& outHadDataReady)
{
    outHadDataReady = false;

    if (!vl53.dataReady())
    {
        return false;
    }
    outHadDataReady = true;

    int distance = vl53.distance();
    uint8_t rangeStatus = 255;
    if (vl53.VL53L1X_GetRangeStatus(&rangeStatus) != VL53L1X_ERROR_NONE)
    {
        rangeStatus = 255;
    }

    vl53.clearInterrupt();

    if (rangeStatus != 0)
    {
        return false;
    }

    if (distance <= 0 || distance > 4000)
    {
        return false;
    }

    outDistance = distance;
    return true;
}

bool computeStableAverageMm(const int* samples, int count, int& outAverage)
{
    if (count <= 0)
    {
        return false;
    }

    int sorted[SAMPLES_PER_SECOND];
    for (int i = 0; i < count; ++i)
    {
        sorted[i] = samples[i];
    }
    std::sort(sorted, sorted + count);

    const int median = sorted[count / 2];
    const int threshold = max(60, median / 8); // 12.5%, minimum 60 mm

    int32_t sum = 0;
    int kept = 0;
    for (int i = 0; i < count; ++i)
    {
        if (abs(sorted[i] - median) <= threshold)
        {
            sum += sorted[i];
            ++kept;
        }
    }

    // If the number of valid points after threshold filtering is too small, it degenerates into a truncated average.
    if (kept < max(3, count / 3))
    {
        int trim = 0;
        if (count >= 10)
        {
            trim = count / 5; // abandon both ends of 20%
        }
        else if (count >= 5)
        {
            trim = 1;
        }

        const int start = trim;
        const int end = count - trim;
        if (start >= end)
        {
            return false;
        }

        sum = 0;
        kept = 0;
        for (int i = start; i < end; ++i)
        {
            sum += sorted[i];
            ++kept;
        }
    }

    if (kept <= 0)
    {
        return false;
    }

    outAverage = static_cast<int>((sum + kept / 2) / kept);
    return true;
}

String buildReportUrl()
{
    String url = REPORT_SERVER;
    String api = REPORT_API;

    if (url.endsWith("/") && api.startsWith("/"))
    {
        url.remove(url.length() - 1);
    }
    else if (!url.endsWith("/") && !api.startsWith("/"))
    {
        url += "/";
    }

    url += api;
    return url;
}

bool initWiFi()
{
    if (strlen(WIFI_SSID) == 0 || strlen(WIFI_PASS) == 0)
    {
        Serial.println("[WARN] WIFI_SSID or WIFI_PASS is empty");
        return false;
    }

    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASS);

    const uint32_t startMs = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - startMs) < WIFI_CONNECT_TIMEOUT_MS)
    {
        delay(200);
    }

    if (WiFi.status() != WL_CONNECTED)
    {
        Serial.println("[WARN] WiFi connect timeout");
        return false;
    }

    Serial.print("[INFO] WiFi connected, IP = ");
    Serial.println(WiFi.localIP());
    return true;
}

const char* classifyBatteryLevel(int percent)
{
    if (percent < 0)
    {
        return "unknown";
    }
    if (percent < 30)
    {
        return "low";
    }
    if (percent < 70)
    {
        return "medium";
    }
    return "high";
}

bool readBatteryVoltageMv(int& outVoltageMv)
{
    int32_t sum = 0;
    int valid = 0;
    for (int i = 0; i < BATTERY_ADC_SAMPLES; ++i)
    {
        int mv = analogReadMilliVolts(BATTERY_ADC_PIN);
        if (mv > 0)
        {
            sum += mv;
            ++valid;
        }
        delay(2);
    }

    if (valid <= 0)
    {
        return false;
    }

    const float adcMv = static_cast<float>(sum) / static_cast<float>(valid);
    outVoltageMv = static_cast<int>(adcMv * BATTERY_DIVIDER_RATIO + 0.5f);
    return true;
}

void updateBatteryStatus(bool forceLog = false)
{
    static uint32_t lastReadMs = 0;
    static int lastLoggedPercent = -1000;

    uint32_t now = millis();
    if (!forceLog && (now - lastReadMs) < BATTERY_READ_INTERVAL_MS)
    {
        return;
    }
    lastReadMs = now;

    int voltageMv = 0;
    if (!readBatteryVoltageMv(voltageMv))
    {
        Serial.println("[WARN] Battery read failed");
        return;
    }

    int percent = (voltageMv - BATTERY_EMPTY_MV) * 100 / (BATTERY_FULL_MV - BATTERY_EMPTY_MV);
    percent = constrain(percent, 0, 100);
    const char* level = classifyBatteryLevel(percent);

    g_batteryVoltageMv = voltageMv;
    g_batteryPercent = percent;
    g_batteryLevel = level;

    if (forceLog || abs(percent - lastLoggedPercent) >= 3)
    {
        Serial.print("[INFO] Battery: ");
        Serial.print(g_batteryVoltageMv);
        Serial.print(" mV, ");
        Serial.print(g_batteryPercent);
        Serial.print("%, ");
        Serial.println(g_batteryLevel);
        lastLoggedPercent = percent;
    }
}

void reportDistanceJson(bool hasValidDistance, int distanceMm, int sampleCount, int dataReadyCount, int validCount)
{
    if (!g_enableHttpReport || !g_isWiFiActive)
    {
        return;
    }

    if (WiFi.status() != WL_CONNECTED)
    {
        static uint32_t lastWarnMs = 0;
        uint32_t now = millis();
        if (now - lastWarnMs >= 5000)
        {
            Serial.println("[WARN] WiFi disconnected, skip HTTP report");
            lastWarnMs = now;
        }
        return;
    }

    String payload = "{";
    payload += "\"ts_ms\":";
    payload += millis();
    payload += ",\"has_valid_distance\":";
    payload += (hasValidDistance ? "true" : "false");
    payload += ",\"distance_mm\":";
    payload += hasValidDistance ? String(distanceMm) : "null";
    payload += ",\"sample_count\":";
    payload += sampleCount;
    payload += ",\"data_ready_count\":";
    payload += dataReadyCount;
    payload += ",\"valid_count\":";
    payload += validCount;
    payload += ",\"battery_mv\":";
    payload += g_batteryVoltageMv;
    payload += ",\"battery_percent\":";
    payload += g_batteryPercent;
    payload += ",\"battery_level\":\"";
    payload += g_batteryLevel;
    payload += "\"";
    payload += "}";

    HTTPClient http;
    const String url = buildReportUrl();
    if (!http.begin(url))
    {
        Serial.println("[WARN] HTTP begin failed");
        return;
    }

    http.addHeader("Content-Type", "application/json");
    const int code = http.POST(payload);
    if (code > 0)
    {
        Serial.print("[INFO] Report POST code = ");
        Serial.println(code);
    }
    else
    {
        Serial.print("[WARN] Report POST failed, code = ");
        Serial.println(code);
    }
    http.end();
}

