superzscy/esp32-distanceRanging/src/main.cpp
bool sampleHeightAverageOneSecond(int& outAverageMm, int& outSampleCount, int& outValidCount)
{
    const bool wasRangingEnabled = g_enableRanging;
    const bool wasRangingActive = g_isRangingActive;

    if (!g_isRangingActive)
    {
        if (!initVL53L1X())
        {
            return false;
        }
        g_isRangingActive = true;
    }

    int samples[SAMPLES_PER_SECOND];
    int sampleCount = 0;
    int validCount = 0;
    uint32_t windowStartMs = millis();
    uint32_t lastSampleMs = windowStartMs - SAMPLE_INTERVAL_MS;

    while (millis() - windowStartMs < STATS_WINDOW_MS)
    {
        const uint32_t now = millis();
        if (now - lastSampleMs >= SAMPLE_INTERVAL_MS)
        {
            lastSampleMs = now;
            int distanceMm = 0;
            bool hadDataReady = false;
            bool valid = readDistanceMm(distanceMm, hadDataReady);
            if (valid && sampleCount < static_cast<int>(SAMPLES_PER_SECOND))
            {
                samples[sampleCount++] = distanceMm;
                ++validCount;
            }
        }
        delay(2);
    }

    bool ok = computeStableAverageMm(samples, sampleCount, outAverageMm);
    outSampleCount = sampleCount;
    outValidCount = validCount;

    if (!wasRangingActive)
    {
        stopRangingIfNeeded();
    }
    g_enableRanging = wasRangingEnabled;
    return ok;
}

bool reportCalibrationDeltaOnce(int initialMm, int currentMm, int deltaMm)
{
    bool tempWiFiStarted = false;

    if (!g_isWiFiActive)
    {
        g_isWiFiActive = initWiFi();
        tempWiFiStarted = g_isWiFiActive;
    }

    if (!g_isWiFiActive || WiFi.status() != WL_CONNECTED)
    {
        Serial.println("[WARN] c2 report skipped: WiFi not connected");
        return false;
    }

    String payload = "{";
    payload += "\"ts_ms\":";
    payload += millis();
    payload += ",\"event\":\"c2_delta\"";
    payload += ",\"initial_height_mm\":";
    payload += initialMm;
    payload += ",\"current_height_mm\":";
    payload += currentMm;
    payload += ",\"delta_mm\":";
    payload += deltaMm;
    payload += ",\"battery_mv\":";
    payload += g_batteryVoltageMv;
    payload += ",\"battery_percent\":";
    payload += g_batteryPercent;
    payload += ",\"battery_level\":\"";
    payload += g_batteryLevel;
    payload += "\"";
    payload += "}";

    HTTPClient http;
    const String url = buildReportUrl();
    if (!http.begin(url))
    {
        Serial.println("[WARN] c2 report HTTP begin failed");
        if (tempWiFiStarted)
        {
            stopWiFiIfNeeded();
        }
        return false;
    }

    http.addHeader("Content-Type", "application/json");
    const int code = http.POST(payload);
    http.end();

    if (tempWiFiStarted)
    {
        stopWiFiIfNeeded();
    }

    if (code > 0)
    {
        Serial.print("[INFO] c2 report POST code = ");
        Serial.println(code);
        return true;
    }

    Serial.print("[WARN] c2 report POST failed, code = ");
    Serial.println(code);
    return false;
}

void runCalibrationCommand(CalibrationCmd cmd)
{
    int avgMm = 0;
    int sampleCount = 0;
    int validCount = 0;

    if (cmd == CalibrationCmd::C1)
    {
        logCommandMessage("[CMD] c1 start: sampling 1s...");
        if (!sampleHeightAverageOneSecond(avgMm, sampleCount, validCount))
        {
            logCommandMessage(String("[CMD] c1 failed: no stable data, samples=") + sampleCount + ", valid=" + validCount);
            return;
        }

        g_initialHeightMm = avgMm;
        g_hasInitialHeight = true;
        logCommandMessage(String("[CMD] c1 done: initial_height_mm=") + g_initialHeightMm + ", samples=" + sampleCount + ", valid=" + validCount);
        return;
    }

    if (cmd == CalibrationCmd::C2)
    {
        if (!g_hasInitialHeight)
        {
            logCommandMessage("[CMD] c2 failed: initial height not set, run c1 first");
            return;
        }

        logCommandMessage("[CMD] c2 start: sampling 1s...");
        if (!sampleHeightAverageOneSecond(avgMm, sampleCount, validCount))
        {
            logCommandMessage(String("[CMD] c2 failed: no stable data, samples=") + sampleCount + ", valid=" + validCount);
            return;
        }

        const int deltaMm = avgMm - g_initialHeightMm;
        logCommandMessage(String("[CMD] c2 done: current_mm=") + avgMm + ", initial_mm=" + g_initialHeightMm + ", delta_mm=" + deltaMm);

        if (!reportCalibrationDeltaOnce(g_initialHeightMm, avgMm, deltaMm))
        {
            logCommandMessage("[CMD] c2 report failed");
        }
        else
        {
            logCommandMessage("[CMD] c2 report sent");
        }
    }
}

void logCommandMessage(const String& msg)
{
    Serial.println(msg);
    if (g_isBluetoothInitialized && SerialBT.hasClient())
    {
        SerialBT.println(msg);
    }
}

void handleCommandLine(const String& cmdLine, const char* source)
{
    if (cmdLine == "w 0")
    {
        g_enableHttpReport = false;
        logCommandMessage(String("[CMD][") + source + "] WiFi disable requested");
    }
    else if (cmdLine == "w 1")
    {
        g_enableHttpReport = true;
        logCommandMessage(String("[CMD][") + source + "] WiFi enable requested");
    }
    else if (cmdLine == "d 0")
    {
        g_enableDisplay = false;
        logCommandMessage(String("[CMD][") + source + "] Display disable requested");
    }
    else if (cmdLine == "d 1")
    {
        g_enableDisplay = true;
        logCommandMessage(String("[CMD][") + source + "] Display enable requested");
    }
    else if (cmdLine == "c1")
    {
        g_pendingCalibrationCmd = CalibrationCmd::C1;
        logCommandMessage(String("[CMD][") + source + "] c1 queued");
    }
    else if (cmdLine == "c2")
    {
        g_pendingCalibrationCmd = CalibrationCmd::C2;
        logCommandMessage(String("[CMD][") + source + "] c2 queued");
    }
    else
    {
        logCommandMessage(String("[CMD][") + source + "] Unsupported command. Use: w 0 | w 1 | d 0 | d 1 | c1 | c2");
    }
}

void processCommandStream(Stream& stream, String& buffer, const char* source)
{
    while (stream.available() > 0)
    {
        const char ch = static_cast<char>(stream.read());
        if (ch == '\r')
        {
            continue;
        }
        if (ch != '\n')
        {
            buffer += ch;
            continue;
        }

        buffer.trim();
        if (buffer.length() > 0)
        {
            handleCommandLine(buffer, source);
        }
        buffer = "";
    }
}

void processCommands()
{
    static String serialCmd;
    static String btCmd;

    processCommandStream(Serial, serialCmd, "SERIAL");
    if (g_isBluetoothInitialized)
    {
        processCommandStream(SerialBT, btCmd, "BT");
    }
}

bool initBluetooth()
{
    static auto btSppCallback = [](esp_spp_cb_event_t event, esp_spp_cb_param_t* param) {
        switch (event)
        {
        case ESP_SPP_INIT_EVT:
            Serial.println("[BT] SPP init done");
            break;
        case ESP_SPP_START_EVT:
            Serial.println("[BT] SPP server started");
            break;
        case ESP_SPP_SRV_OPEN_EVT:
            g_btClientConnected = true;
            Serial.println("[BT] Client connected (SRV_OPEN)");
            break;
        case ESP_SPP_OPEN_EVT:
            g_btClientConnected = true;
            Serial.println("[BT] Client connected (OPEN)");
            break;
        case ESP_SPP_CLOSE_EVT:
            g_btClientConnected = false;
            Serial.print("[BT] Client disconnected, close.status = ");
            if (param != nullptr)
            {
                Serial.println(static_cast<int>(param->close.status));
            }
            else
            {
                Serial.println("-1");
            }
            break;
        default:
            break;
        }
    };

