superzscy/esp32-distanceRanging/src/main.cpp
    SerialBT.register_callback(btSppCallback);

    if (!SerialBT.begin(BT_DEVICE_NAME))
    {
        Serial.println("[WARN] Bluetooth init failed");
        return false;
    }
    Serial.print("[INFO] Bluetooth SPP started: ");
    Serial.println(BT_DEVICE_NAME);
    return true;
}

void stopBluetoothIfNeeded()
{
    if (!g_isBluetoothInitialized)
    {
        return;
    }
    SerialBT.end();
    g_isBluetoothInitialized = false;
    Serial.println("[INFO] Bluetooth stopped");
}

void stopWiFiIfNeeded()
{
    if (!g_isWiFiActive)
    {
        return;
    }

    WiFi.disconnect(true, true);
    WiFi.mode(WIFI_OFF);
    g_isWiFiActive = false;
    Serial.println("[INFO] WiFi stopped");
}

void stopRangingIfNeeded()
{
    if (!g_isRangingActive)
    {
        return;
    }
    vl53.stopRanging();
    g_isRangingActive = false;
    Serial.println("[INFO] Ranging stopped");
}

void stopDisplayIfNeeded()
{
    if (!g_isDisplayActive)
    {
        return;
    }

    display.clearDisplay();
    display.display();
    g_isDisplayActive = false;
    Serial.println("[INFO] Display stopped");
}

void enableBluetoothLowPowerMode()
{
    if (!g_isBluetoothInitialized)
    {
        return;
    }

#if HAS_BT_MODEM_SLEEP_API
    esp_err_t err = esp_bt_sleep_enable();
    if (err == ESP_OK)
    {
        Serial.println("[INFO] Bluetooth low-power sleep enabled");
    }
    else
    {
        Serial.print("[WARN] Bluetooth low-power sleep enable failed, err = ");
        Serial.println(static_cast<int>(err));
    }
#else
    Serial.println("[INFO] Bluetooth low-power sleep API unavailable on this core, skipped");
#endif
}

void disableBluetoothLowPowerMode()
{
    if (!g_isBluetoothInitialized)
    {
        return;
    }

#if HAS_BT_MODEM_SLEEP_API
    esp_err_t err = esp_bt_sleep_disable();
    if (err == ESP_OK)
    {
        Serial.println("[INFO] Bluetooth low-power sleep disabled");
    }
    else
    {
        Serial.print("[WARN] Bluetooth low-power sleep disable failed, err = ");
        Serial.println(static_cast<int>(err));
    }
#endif
}

void enterStandbyLowPowerMode()
{
    if (g_isLowPowerActive)
    {
        return;
    }

    g_enableHttpReport = false;
    g_enableDisplay = false;
    g_enableRanging = false;

    stopWiFiIfNeeded();
    stopRangingIfNeeded();
    stopDisplayIfNeeded();

    enableBluetoothLowPowerMode();
    g_isLowPowerActive = true;
    Serial.println("[INFO] Standby low-power mode entered");
}

void exitStandbyLowPowerMode()
{
    if (!g_isLowPowerActive)
    {
        return;
    }

    disableBluetoothLowPowerMode();

    g_isLowPowerActive = false;
    Serial.println("[INFO] Standby low-power mode exited");
}

// =========================
// Arduino entry
// =========================

void setup()
{
    Serial.begin(115200);
    delay(300);

    Serial.println();
    Serial.println("================================");
    Serial.println("ESP32 + VL53L1X + OLED Test");
    Serial.println("================================");

    g_isBluetoothInitialized = initBluetooth();

    Wire.begin(I2C_SDA, I2C_SCL);
#if defined(ADC_11db)
    analogSetPinAttenuation(BATTERY_ADC_PIN, ADC_11db);
#elif defined(ADC_ATTEN_DB_12)
    analogSetPinAttenuation(BATTERY_ADC_PIN, ADC_ATTEN_DB_12);
#endif
    updateBatteryStatus(true);
    Serial.println("[INFO] Display switch default is OFF (use d 1 to enable)");
    Serial.println("[INFO] Standby mode is ON by default (connect BT to wake, use s 0 to disable)");
}

void loop()
{
    processCommands();

    static uint32_t windowStartMs = 0;
    static uint32_t lastSampleMs  = 0;
    static int samples[SAMPLES_PER_SECOND];
    static int sampleCount = 0;
    static int dataReadyCount = 0;
    static int validCount = 0;
    static uint8_t emptyWindowCount = 0;
    static bool lastRangingEnabled = false;
    static bool lastHttpEnabled = false;
    static bool lastDisplayEnabled = false;
    static bool lastBtClientConnected = false;
    static uint32_t btDisconnectedSinceMs = 0;
    static uint32_t lastRangingInitAttemptMs = 0;
    static uint32_t lastWiFiAttemptMs = 0;
    static uint32_t lastDisplayInitAttemptMs = 0;
    static uint32_t lastOffLogMs = 0;

    auto resetWindow = [&]() {
        sampleCount = 0;
        dataReadyCount = 0;
        validCount = 0;
        emptyWindowCount = 0;
        windowStartMs = millis();
        lastSampleMs = windowStartMs - SAMPLE_INTERVAL_MS;
    };

    uint32_t now = millis();
    if (windowStartMs == 0)
    {
        windowStartMs = now;
        lastSampleMs = now - SAMPLE_INTERVAL_MS;
    }

    updateBatteryStatus(false);

    const bool btClientConnected = g_isBluetoothInitialized && g_btClientConnected;
    if (lastBtClientConnected != btClientConnected)
    {
        if (btClientConnected)
        {
            exitStandbyLowPowerMode();
            btDisconnectedSinceMs = 0;
        }
        else
        {
            btDisconnectedSinceMs = now;
        }
    }
    lastBtClientConnected = btClientConnected;

    if (!btClientConnected && !g_isLowPowerActive)
    {
        if (btDisconnectedSinceMs == 0)
        {
            btDisconnectedSinceMs = now;
        }
        if (now - btDisconnectedSinceMs >= STANDBY_ENTER_DELAY_MS)
        {
            enterStandbyLowPowerMode();
        }
    }

    if (g_isLowPowerActive)
    {
        delay(120);
        return;
    }

    if (g_pendingCalibrationCmd != CalibrationCmd::None)
    {
        CalibrationCmd cmd = g_pendingCalibrationCmd;
        g_pendingCalibrationCmd = CalibrationCmd::None;
        runCalibrationCommand(cmd);
    }

    // Runtime WiFi on/off handling
    if (g_enableHttpReport && !g_isWiFiActive)
    {
        if (now - lastWiFiAttemptMs >= 3000)
        {
            lastWiFiAttemptMs = now;
            g_isWiFiActive = initWiFi();
            if (g_isWiFiActive)
            {
                g_enableRanging = true;
            }
            else
            {
                Serial.println("[WARN] WiFi enable requested but not ready");
            }
        }
    }
    else if (!g_enableHttpReport && g_isWiFiActive)
    {
        stopWiFiIfNeeded();
    }

    // Runtime display on/off handling
    if (g_enableDisplay && !g_isDisplayActive)
    {
        if (now - lastDisplayInitAttemptMs >= 1000)
        {
            lastDisplayInitAttemptMs = now;
            if (initOLED())
            {
                g_isDisplayActive = true;
                showCenteredText("Ranging OFF", g_isWiFiActive ? "WiFi ON" : "WiFi OFF");
            }
            else
            {
                Serial.println("[WARN] Display enable requested but init failed");
            }
        }
    }
    else if (!g_enableDisplay && g_isDisplayActive)
    {
        stopDisplayIfNeeded();
    }

