superzscy/esp32-distanceRanging/src/main.cpp
    // Runtime ranging on/off handling
    if (g_enableRanging && !g_isRangingActive)
    {
        if (now - lastRangingInitAttemptMs >= 1000)
        {
            lastRangingInitAttemptMs = now;
            if (initVL53L1X())
            {
                g_isRangingActive = true;
                resetWindow();
                showCenteredText("Ranging ON", g_isWiFiActive ? "WiFi ON" : "WiFi OFF");
            }
            else
            {
                Serial.println("[WARN] Ranging enable requested but init failed");
            }
        }
    }
    else if (!g_enableRanging && g_isRangingActive)
    {
        stopRangingIfNeeded();
        resetWindow();
        showCenteredText("Ranging OFF", g_isWiFiActive ? "WiFi ON" : "WiFi OFF");
    }

    if (!g_isRangingActive)
    {
        if (g_enableRanging != lastRangingEnabled || g_enableHttpReport != lastHttpEnabled || g_enableDisplay != lastDisplayEnabled)
        {
            showCenteredText("Ranging OFF", g_isWiFiActive ? "WiFi ON" : "WiFi OFF");
            lastRangingEnabled = g_enableRanging;
            lastHttpEnabled = g_enableHttpReport;
            lastDisplayEnabled = g_enableDisplay;
        }
        if (now - lastOffLogMs >= 3000)
        {
            lastOffLogMs = now;
        }
        delay(20);
        return;
    }

    if (now - lastSampleMs >= SAMPLE_INTERVAL_MS)
    {
        lastSampleMs = now;
        int distanceMm = 0;
        bool hadDataReady = false;
        bool valid = readDistanceMm(distanceMm, hadDataReady);
        if (hadDataReady)
        {
            ++dataReadyCount;
        }
        if (valid && sampleCount < static_cast<int>(SAMPLES_PER_SECOND))
        {
            samples[sampleCount++] = distanceMm;
            ++validCount;
        }
    }

    if (now - windowStartMs >= STATS_WINDOW_MS)
    {
        int stableAverageMm = 0;
        if (computeStableAverageMm(samples, sampleCount, stableAverageMm))
        {
            showDistanceScreen(stableAverageMm);
            reportDistanceJson(true, stableAverageMm, sampleCount, dataReadyCount, validCount);
            Serial.print("[INFO] Stable Avg = ");
            Serial.print(stableAverageMm);
            Serial.print(" mm, kept = ");
            Serial.print(sampleCount);
            Serial.print(", dataReady = ");
            Serial.print(dataReadyCount);
            Serial.print(", valid = ");
            Serial.println(validCount);
            emptyWindowCount = 0;
        }
        else
        {
            showCenteredText("Measuring...", "No valid data");
            reportDistanceJson(false, 0, sampleCount, dataReadyCount, validCount);
            Serial.print("[WARN] No valid window data, kept = ");
            Serial.print(sampleCount);
            Serial.print(", dataReady = ");
            Serial.print(dataReadyCount);
            Serial.print(", valid = ");
            Serial.println(validCount);

            if (dataReadyCount == 0)
            {
                ++emptyWindowCount;
                if (emptyWindowCount >= MAX_EMPTY_WINDOWS_BEFORE_RECOVER)
                {
                    recoverVL53L1X();
                    emptyWindowCount = 0;
                }
            }
            else
            {
                emptyWindowCount = 0;
            }
        }

        sampleCount = 0;
        dataReadyCount = 0;
        validCount = 0;
        windowStartMs = now;
    }

    delay(2);
}
